
#1. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.

# n = int(input())
# total = 0

# for i in range(1, n + 1):
#     total = total + i  

# print( f"1-დან {n}-მდე ჯამი: {total}")


#2. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს "while" ციკლს რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე. მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1

# n = int(input())

# while n > 0:
#     print(n)
#     n -= 1


#3. დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოიცნოს წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.

# secret = 42 

# while True:
#     guess = int(input("შეიყვანე რიცხვი: "))

#     if guess < secret:
#         print("მეტია! კიდევ სცადე.")
#     elif guess > secret:
#         print("ნაკლებია! კიდევ სცადე.")
#     else:
#         print("სწორია!")
#         break 

# 4. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 'sum' ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.

total_sum = 0

while True:
    user_input = input("რიცხვი ან 'sum': ")
    
    if user_input == 'sum':
        break
        
    number = float(user_input)
    if number > 0:
        total_sum += number

print("ჯამი:", total_sum)
